In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\pooja\miniconda3\lib\site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\pooja\miniconda3\lib\site-packages (from pandas) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pooja\miniconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\pooja\miniconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\pooja\miniconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\pooja\miniconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd
data ={"name" : ["john","pooja","lisa"],
      "age":[25,28,31],
      "salary": [20000,30000,40000]}
df =pd.DataFrame(data)
df

    name  age  salary
0   john   25   20000
1  pooja   28   30000
2   lisa   31   40000

In [14]:
data = pd.read_csv("C:/Users/Pooja/OneDrive/Desktop/opju/csv.csv")
data

   S No OrderID   OrderDate DeliveryDate Mr./Mrs.Miss Name    Value
0     1   10010  17-01-2023   25-01-2324          Mr.    j   Rs.900
1     2   10011  18-01-2023   26-01-2324         Mrs.    k  Rs.1000
2     3   10012  19-01-2023   27-01-2324          Mr.    l  Rs.1100
3     4   10013  20-01-2023   28-01-2324         Mrs.    m  Rs.1200
4     5   10014  21-01-2023   29-01-2324          Mr.    n  Rs.1300
5     6   10015  22-01-2023   30-01-2324         Mrs.    o  Rs.1400
6     7   10016  23-01-2023   31-01-2324          Mr.    p  Rs.1500
7     8    xxxx  24-01-2023   01-02-2324         Mrs.    q  Rs.1600
8     9   10018  25-01-2023   02-02-2324          Mr.    r  Rs.1700

In [ ]:
# exploring data in pandas

In [22]:
data= pd.read_excel("C:/Users/Pooja/Downloads/ESD.xlsx")
data
print(data.head(10))
print(data.tail(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT
       EEID          Full Name             Job Title       Department  \
990  E01578       Anthony Hong            Sr. Manger               IT
991  E03430        Leo Herrera  Sr. Business Partner  Human Resources
992  E03058      Robert Wright   Technical Architect               IT
993  E04762  Audrey Richardson              Director               IT
994  E01148     Scarlett Kumar       Systems Analyst               IT
995  E03094       Wesley Young           Sr. Analyst        Marketing
996  E01909       Lillian Khan               Analyst          Finance
997  E04398        Oliver Yang              Director        Marketing
998  E02521        Lily Nguyen           Sr. Analyst          Finance
999  E03545        Sofia Cheng        Vice President       Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
990  Research & Development    Male      Asian   37 2010-11-29         146961
991  Research & Development    Male     Latino   48 1998-04-22          85369
992           Manufacturing    Male  Caucasian   30 2015-06-14          67489
993           Manufacturing  Female  Caucasian   46 2018-10-06         166259
994               Corporate  Female      Asian   55 2009-01-07          47032
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country      City  Exit Date
990     0.11  United States  Columbus        NaT
991     0.00         Brazil    Manaus 2004-11-27
992     0.00  United States   Chicago        NaT
993     0.17  United States   Chicago        NaT
994     0.00  United States  Columbus        NaT
995     0.00  United States  Columbus        NaT
996     0.00          China   Chengdu 2018-01-08
997     0.15  United States     Miami        NaT
998     0.00          China   Chengdu        NaT
999     0.31  United States     Miami        NaT

In [24]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

In [25]:
data.describe()

,Age,Hire Date,Annual Salary,Bonus %,Exit Date
count,1000.000000,1000,1000.000000,1000.000000,85
mean,44.382000,2012-04-07 02:54:14.400000,113217.365000,0.088660,2016-11-02 18:04:14.117647104
min,25.000000,1992-01-09 00:00:00,40063.000000,0.000000,1994-12-18 00:00:00
25%,35.000000,2007-02-14 00:00:00,71430.250000,0.000000,2014-12-25 00:00:00
50%,45.000000,2014-02-15 12:00:00,96557.000000,0.000000,2019-05-23 00:00:00
75%,54.000000,2018-06-22 00:00:00,150782.250000,0.150000,2021-04-09 00:00:00
max,65.000000,2021-12-26 00:00:00,258498.000000,0.400000,2022-08-17 00:00:00
std,11.246981,NaN,53545.985644,0.117856,NaN

In [27]:
print (data.isnull().sum())

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

In [ ]:
##dealing with duplicate values in pandas

In [30]:
data=pd.read_csv("C:/Users/Pooja/Downloads/company1.csv")
data

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [32]:
print (data["EEID"].duplicated()) #giving the duplicate value as true and false

0    False
1    False
2    False
3     True
4    False
5    False
6     True
Name: EEID, dtype: bool

In [33]:
print(data["EEID"].duplicated().sum()) #number of duplicate value

2

In [35]:
print(data.drop_duplicates("EEID"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

In [37]:
print(data.drop_duplicates("Name")) #but this is not reccomended because usally we have more than one person with same name

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0

In [ ]:
# working with missing data in pandas

In [38]:
data=pd.read_csv("C:/Users/Pooja/Downloads/company1.csv")
data

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [39]:
print(data.isnull())

    EEID   Name  gender  salary
0  False  False   False    True
1  False  False   False   False
2  False  False    True   False
3  False  False   False   False
4  False   True   False   False
5  False  False   False    True
6  False  False   False   False

In [40]:
print(data.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [41]:
print(data.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [42]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [62]:
import numpy as np
print(data.replace(np.nan,26000))

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  26000  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     26000      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [61]:
data["salary"]=(data["salary"].replace(np.nan,26000))

print (data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [53]:
print(data["salary"].mean())

26000.0

In [48]:
print(data["salary"].mean())

26000.0

In [57]:


print (data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [59]:
import numpy as np
data["salary"]=data["salary"].replace(np.nan,24400)

print (data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [63]:
data=pd.read_csv("C:/Users/Pooja/Downloads/company1.csv")
data

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [65]:
import numpy as np
data["salary"]=data["salary"].replace(np.nan,24400)

print (data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [66]:
data=pd.read_csv("C:/Users/Pooja/Downloads/company1.csv")
data

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [67]:
import numpy as np
data["salary"]=data["salary"].replace(np.nan,26000)

print (data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  26000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  26000.0
6  EMP02     rohit      M  25000.0

In [70]:
print(data.fillna(method= "bfill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  26000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  26000.0
6  EMP02     rohit      M  25000.0

C:\Users\Pooja\AppData\Local\Temp\ipykernel_21640\2707874273.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method= "bfill"))

In [71]:
print(data.fillna(method= "ffill"))

    EEID      Name gender   salary
0  EMP01    ayushi      F  26000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  26000.0
6  EMP02     rohit      M  25000.0

C:\Users\Pooja\AppData\Local\Temp\ipykernel_21640\3333980404.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method= "ffill"))

In [ ]:
#columns transformation in pandas

In [4]:
import pandas as pd 
df= pd.read_excel("C:/Users/Pooja/Downloads/ESD.xlsx")
df
df.loc[(df["Bonus %"]==0),"getBonus"]="no bonus "
df.loc[(df["Bonus %"]>0),"getBonus"]=" bonus "
print(df.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date   getBonus
0     0.15  United States    Seattle 2021-10-16     bonus
1     0.00          China  Chongqing        NaT  no bonus
2     0.20  United States    Chicago        NaT     bonus
3     0.07  United States    Chicago        NaT     bonus
4     0.00  United States    Phoenix        NaT  no bonus
5     0.00          China  Chongqing        NaT  no bonus
6     0.10  United States    Phoenix        NaT     bonus
7     0.00  United States      Miami 2021-05-20  no bonus
8     0.06  United States     Austin        NaT     bonus
9     0.00  United States    Chicago        NaT  no bonus

In [6]:
import pandas as pd
data= pd.read_csv("C:/Users/Pooja/Downloads/company1.csv")
data

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [14]:
import pandas as pd
data= pd.read_excel("C:/Users/Pooja/Downloads/banking Data.xlsx")
data.head(10)
data["full detail"]=data["Name"]+data["Sex"]
print(data)

     Client ID              Name  Age     Sex  Location ID Joined Bank  \
0     PKR81288     Raymond Mills   24    Male        34324  2019-05-06
1     PKR65833     Julia Spencer   23    Male        42205  2001-12-10
2     PKR47499    Stephen Murray   27  Female         7314  2010-01-25
3     PKR72498    Virginia Garza   40    Male        34594  1993-03-28
4     PKR60181   Melissa Sanders   46  Female        41269  2012-07-20
...        ...               ...  ...     ...          ...         ...
2995  PKR66827         Earl Hall   82  Female         8760  2014-10-09
2996  PKR40556  Billy Williamson   44  Female        32837  2009-02-05
2997  PKR72414      Victor Black   70  Female        36088  2009-12-29
2998  PKR46652       Andrew Ford   56  Female        24871  2006-02-13
2999  PKR40216        Amy Nguyen   79  Female        38518  2005-12-08

          Banking Contact Nationality                     Occupation  \
0          Anthony Torres    American           Safety Technician IV
1        Jonathan Hawkins     African            Software Consultant
2           Anthony Berry    European             Help Desk Operator
3              Steve Diaz    American                   Geologist II
4              Shawn Long    American            Assistant Professor
...                   ...         ...                            ...
2995       Joshua Bennett    American       Accounting Assistant III
2996          Dennis Ruiz    European                      Paralegal
2997          Joshua Ryan    American                Statistician IV
2998  Nicholas Cunningham    European  Human Resources Assistant III
2999           Joe Hanson    American            Biostatistician III

     Investment Advisor  ... Credit Card Balance    Bank Loans Bank Deposits  \
0           Victor Dean  ...            484.5440  7.762429e+05  1.485829e+06
1         Jeremy Porter  ...           2256.8777  1.270615e+06  6.414828e+05
2         Ernest Knight  ...           4568.7438  1.052716e+06  1.033402e+06
3             Eric Shaw  ...           4205.0010  1.211951e+05  1.048157e+06
4             Kevin Kim  ...           3779.4880  1.048302e+06  4.877825e+05
...                 ...  ...                 ...           ...           ...
2995     Daniel Carroll  ...            649.8540  2.239351e+05  1.089957e+06
2996     Peter Castillo  ...           1639.0350  5.959020e+05  1.368913e+05
2997      Steve Sanchez  ...           2352.8448  8.804930e+05  2.148609e+05
2998       Juan Ramirez  ...           3578.6088  2.686250e+05  7.426302e+05
2999     Peter Castillo  ...           1494.6876  2.856407e+05  6.561766e+04

      Checking Accounts  Saving Accounts  Foreign Currency Account  \
0          6.036179e+05    607332.455240                12249.9584
1          2.295214e+05    344635.157402                61162.3089
2          6.526747e+05    203054.348179                79071.7794
3          1.048157e+06    234685.019326                57513.6520
4          4.466442e+05    128351.452320                30012.1360
...                 ...              ...                       ...
2995       5.328679e+05    657849.619325                12947.3100
2996       5.658174e+04     93195.608103                23205.6900
2997       1.587261e+05     35539.152952                30291.8112
2998       4.046383e+05     56411.334112                 6413.1444
2999       7.776908e+04     32371.380536                 8992.3608

      Business Lending  Properties Owned  Risk Weighting  \
0         1.134475e+06                 1               2
1         2.000526e+06                 1               3
2         5.481376e+05                 1               3
3         1.148402e+06                 0               4
4         1.674412e+06                 0               3
...                ...               ...             ...
2995      1.238860e+06                 1               3
2996      2.771711e+05                 1               2
2997      5.029472e+05                 2               2
2998      1.538369e+06                 3               1
2999      3.294125e+05                 1               1

                 full detail
0          Raymond MillsMale
1          Julia SpencerMale
2       Stephen MurrayFemale
3         Virginia GarzaMale
4      Melissa SandersFemale
...                      ...
2995         Earl HallFemale
2996  Billy WilliamsonFemale
2997      Victor BlackFemale
2998       Andrew FordFemale
2999        Amy NguyenFemale

[3000 rows x 26 columns]

In [15]:
print(data)
data["full detail"]=data["Name"]+data["Sex"] 
print(data)

     Client ID              Name  Age     Sex  Location ID Joined Bank  \
0     PKR81288     Raymond Mills   24    Male        34324  2019-05-06
1     PKR65833     Julia Spencer   23    Male        42205  2001-12-10
2     PKR47499    Stephen Murray   27  Female         7314  2010-01-25
3     PKR72498    Virginia Garza   40    Male        34594  1993-03-28
4     PKR60181   Melissa Sanders   46  Female        41269  2012-07-20
...        ...               ...  ...     ...          ...         ...
2995  PKR66827         Earl Hall   82  Female         8760  2014-10-09
2996  PKR40556  Billy Williamson   44  Female        32837  2009-02-05
2997  PKR72414      Victor Black   70  Female        36088  2009-12-29
2998  PKR46652       Andrew Ford   56  Female        24871  2006-02-13
2999  PKR40216        Amy Nguyen   79  Female        38518  2005-12-08

          Banking Contact Nationality                     Occupation  \
0          Anthony Torres    American           Safety Technician IV
1        Jonathan Hawkins     African            Software Consultant
2           Anthony Berry    European             Help Desk Operator
3              Steve Diaz    American                   Geologist II
4              Shawn Long    American            Assistant Professor
...                   ...         ...                            ...
2995       Joshua Bennett    American       Accounting Assistant III
2996          Dennis Ruiz    European                      Paralegal
2997          Joshua Ryan    American                Statistician IV
2998  Nicholas Cunningham    European  Human Resources Assistant III
2999           Joe Hanson    American            Biostatistician III

     Investment Advisor  ... Credit Card Balance    Bank Loans Bank Deposits  \
0           Victor Dean  ...            484.5440  7.762429e+05  1.485829e+06
1         Jeremy Porter  ...           2256.8777  1.270615e+06  6.414828e+05
2         Ernest Knight  ...           4568.7438  1.052716e+06  1.033402e+06
3             Eric Shaw  ...           4205.0010  1.211951e+05  1.048157e+06
4             Kevin Kim  ...           3779.4880  1.048302e+06  4.877825e+05
...                 ...  ...                 ...           ...           ...
2995     Daniel Carroll  ...            649.8540  2.239351e+05  1.089957e+06
2996     Peter Castillo  ...           1639.0350  5.959020e+05  1.368913e+05
2997      Steve Sanchez  ...           2352.8448  8.804930e+05  2.148609e+05
2998       Juan Ramirez  ...           3578.6088  2.686250e+05  7.426302e+05
2999     Peter Castillo  ...           1494.6876  2.856407e+05  6.561766e+04

      Checking Accounts  Saving Accounts  Foreign Currency Account  \
0          6.036179e+05    607332.455240                12249.9584
1          2.295214e+05    344635.157402                61162.3089
2          6.526747e+05    203054.348179                79071.7794
3          1.048157e+06    234685.019326                57513.6520
4          4.466442e+05    128351.452320                30012.1360
...                 ...              ...                       ...
2995       5.328679e+05    657849.619325                12947.3100
2996       5.658174e+04     93195.608103                23205.6900
2997       1.587261e+05     35539.152952                30291.8112
2998       4.046383e+05     56411.334112                 6413.1444
2999       7.776908e+04     32371.380536                 8992.3608

      Business Lending  Properties Owned  Risk Weighting  \
0         1.134475e+06                 1               2
1         2.000526e+06                 1               3
2         5.481376e+05                 1               3
3         1.148402e+06                 0               4
4         1.674412e+06                 0               3
...                ...               ...             ...
2995      1.238860e+06                 1               3
2996      2.771711e+05                 1               2
2997      5.029472e+05                 2               2
2998      1.538369e+06                 3               1
2999      3.294125e+05                 1               1

                 full detail
0          Raymond MillsMale
1          Julia SpencerMale
2       Stephen MurrayFemale
3         Virginia GarzaMale
4      Melissa SandersFemale
...                      ...
2995         Earl HallFemale
2996  Billy WilliamsonFemale
2997      Victor BlackFemale
2998       Andrew FordFemale
2999        Amy NguyenFemale

[3000 rows x 26 columns]
     Client ID              Name  Age     Sex  Location ID Joined Bank  \
0     PKR81288     Raymond Mills   24    Male        34324  2019-05-06
1     PKR65833     Julia Spencer   23    Male        42205  2001-12-10
2     PKR47499    Stephen Murray   27  Female         7314  2010-01-25
3     PKR72498    Virginia Garza   40    Male        34594  1993-03-28
4     PKR60181   Melissa Sanders   46  Female        41269  2012-07-20
...        ...               ...  ...     ...          ...         ...
2995  PKR66827         Earl Hall   82  Female         8760  2014-10-09
2996  PKR40556  Billy Williamson   44  Female        32837  2009-02-05
2997  PKR72414      Victor Black   70  Female        36088  2009-12-29
2998  PKR46652       Andrew Ford   56  Female        24871  2006-02-13
2999  PKR40216        Amy Nguyen   79  Female        38518  2005-12-08

          Banking Contact Nationality                     Occupation  \
0          Anthony Torres    American           Safety Technician IV
1        Jonathan Hawkins     African            Software Consultant
2           Anthony Berry    European             Help Desk Operator
3              Steve Diaz    American                   Geologist II
4              Shawn Long    American            Assistant Professor
...                   ...         ...                            ...
2995       Joshua Bennett    American       Accounting Assistant III
2996          Dennis Ruiz    European                      Paralegal
2997          Joshua Ryan    American                Statistician IV
2998  Nicholas Cunningham    European  Human Resources Assistant III
2999           Joe Hanson    American            Biostatistician III

     Investment Advisor  ... Credit Card Balance    Bank Loans Bank Deposits  \
0           Victor Dean  ...            484.5440  7.762429e+05  1.485829e+06
1         Jeremy Porter  ...           2256.8777  1.270615e+06  6.414828e+05
2         Ernest Knight  ...           4568.7438  1.052716e+06  1.033402e+06
3             Eric Shaw  ...           4205.0010  1.211951e+05  1.048157e+06
4             Kevin Kim  ...           3779.4880  1.048302e+06  4.877825e+05
...                 ...  ...                 ...           ...           ...
2995     Daniel Carroll  ...            649.8540  2.239351e+05  1.089957e+06
2996     Peter Castillo  ...           1639.0350  5.959020e+05  1.368913e+05
2997      Steve Sanchez  ...           2352.8448  8.804930e+05  2.148609e+05
2998       Juan Ramirez  ...           3578.6088  2.686250e+05  7.426302e+05
2999     Peter Castillo  ...           1494.6876  2.856407e+05  6.561766e+04

      Checking Accounts  Saving Accounts  Foreign Currency Account  \
0          6.036179e+05    607332.455240                12249.9584
1          2.295214e+05    344635.157402                61162.3089
2          6.526747e+05    203054.348179                79071.7794
3          1.048157e+06    234685.019326                57513.6520
4          4.466442e+05    128351.452320                30012.1360
...                 ...              ...                       ...
2995       5.328679e+05    657849.619325                12947.3100
2996       5.658174e+04     93195.608103                23205.6900
2997       1.587261e+05     35539.152952                30291.8112
2998       4.046383e+05     56411.334112                 6413.1444
2999       7.776908e+04     32371.380536                 8992.3608

      Business Lending  Properties Owned  Risk Weighting  \
0         1.134475e+06                 1               2
1         2.000526e+06                 1               3
2         5.481376e+05                 1               3
3         1.148402e+06                 0               4
4         1.674412e+06                 0               3
...                ...               ...             ...
2995      1.238860e+06                 1               3
2996      2.771711e+05                 1               2
2997      5.029472e+05                 2               2
2998      1.538369e+06                 3               1
2999      3.294125e+05                 1               1

                 full detail
0          Raymond MillsMale
1          Julia SpencerMale
2       Stephen MurrayFemale
3         Virginia GarzaMale
4      Melissa SandersFemale
...                      ...
2995         Earl HallFemale
2996  Billy WilliamsonFemale
2997      Victor BlackFemale
2998       Andrew FordFemale
2999        Amy NguyenFemale

[3000 rows x 26 columns]

In [18]:
print(data)
data["full detail"]=data["Name"] + "   " +data["Sex"] 
print(data)

     Client ID              Name  Age     Sex  Location ID Joined Bank  \
0     PKR81288     Raymond Mills   24    Male        34324  2019-05-06
1     PKR65833     Julia Spencer   23    Male        42205  2001-12-10
2     PKR47499    Stephen Murray   27  Female         7314  2010-01-25
3     PKR72498    Virginia Garza   40    Male        34594  1993-03-28
4     PKR60181   Melissa Sanders   46  Female        41269  2012-07-20
...        ...               ...  ...     ...          ...         ...
2995  PKR66827         Earl Hall   82  Female         8760  2014-10-09
2996  PKR40556  Billy Williamson   44  Female        32837  2009-02-05
2997  PKR72414      Victor Black   70  Female        36088  2009-12-29
2998  PKR46652       Andrew Ford   56  Female        24871  2006-02-13
2999  PKR40216        Amy Nguyen   79  Female        38518  2005-12-08

          Banking Contact Nationality                     Occupation  \
0          Anthony Torres    American           Safety Technician IV
1        Jonathan Hawkins     African            Software Consultant
2           Anthony Berry    European             Help Desk Operator
3              Steve Diaz    American                   Geologist II
4              Shawn Long    American            Assistant Professor
...                   ...         ...                            ...
2995       Joshua Bennett    American       Accounting Assistant III
2996          Dennis Ruiz    European                      Paralegal
2997          Joshua Ryan    American                Statistician IV
2998  Nicholas Cunningham    European  Human Resources Assistant III
2999           Joe Hanson    American            Biostatistician III

     Investment Advisor  ... Credit Card Balance    Bank Loans Bank Deposits  \
0           Victor Dean  ...            484.5440  7.762429e+05  1.485829e+06
1         Jeremy Porter  ...           2256.8777  1.270615e+06  6.414828e+05
2         Ernest Knight  ...           4568.7438  1.052716e+06  1.033402e+06
3             Eric Shaw  ...           4205.0010  1.211951e+05  1.048157e+06
4             Kevin Kim  ...           3779.4880  1.048302e+06  4.877825e+05
...                 ...  ...                 ...           ...           ...
2995     Daniel Carroll  ...            649.8540  2.239351e+05  1.089957e+06
2996     Peter Castillo  ...           1639.0350  5.959020e+05  1.368913e+05
2997      Steve Sanchez  ...           2352.8448  8.804930e+05  2.148609e+05
2998       Juan Ramirez  ...           3578.6088  2.686250e+05  7.426302e+05
2999     Peter Castillo  ...           1494.6876  2.856407e+05  6.561766e+04

      Checking Accounts  Saving Accounts  Foreign Currency Account  \
0          6.036179e+05    607332.455240                12249.9584
1          2.295214e+05    344635.157402                61162.3089
2          6.526747e+05    203054.348179                79071.7794
3          1.048157e+06    234685.019326                57513.6520
4          4.466442e+05    128351.452320                30012.1360
...                 ...              ...                       ...
2995       5.328679e+05    657849.619325                12947.3100
2996       5.658174e+04     93195.608103                23205.6900
2997       1.587261e+05     35539.152952                30291.8112
2998       4.046383e+05     56411.334112                 6413.1444
2999       7.776908e+04     32371.380536                 8992.3608

      Business Lending  Properties Owned  Risk Weighting  \
0         1.134475e+06                 1               2
1         2.000526e+06                 1               3
2         5.481376e+05                 1               3
3         1.148402e+06                 0               4
4         1.674412e+06                 0               3
...                ...               ...             ...
2995      1.238860e+06                 1               3
2996      2.771711e+05                 1               2
2997      5.029472e+05                 2               2
2998      1.538369e+06                 3               1
2999      3.294125e+05                 1               1

                  full detail
0          Raymond Mills Male
1          Julia Spencer Male
2       Stephen Murray Female
3         Virginia Garza Male
4      Melissa Sanders Female
...                       ...
2995         Earl Hall Female
2996  Billy Williamson Female
2997      Victor Black Female
2998       Andrew Ford Female
2999        Amy Nguyen Female

[3000 rows x 26 columns]
     Client ID              Name  Age     Sex  Location ID Joined Bank  \
0     PKR81288     Raymond Mills   24    Male        34324  2019-05-06
1     PKR65833     Julia Spencer   23    Male        42205  2001-12-10
2     PKR47499    Stephen Murray   27  Female         7314  2010-01-25
3     PKR72498    Virginia Garza   40    Male        34594  1993-03-28
4     PKR60181   Melissa Sanders   46  Female        41269  2012-07-20
...        ...               ...  ...     ...          ...         ...
2995  PKR66827         Earl Hall   82  Female         8760  2014-10-09
2996  PKR40556  Billy Williamson   44  Female        32837  2009-02-05
2997  PKR72414      Victor Black   70  Female        36088  2009-12-29
2998  PKR46652       Andrew Ford   56  Female        24871  2006-02-13
2999  PKR40216        Amy Nguyen   79  Female        38518  2005-12-08

          Banking Contact Nationality                     Occupation  \
0          Anthony Torres    American           Safety Technician IV
1        Jonathan Hawkins     African            Software Consultant
2           Anthony Berry    European             Help Desk Operator
3              Steve Diaz    American                   Geologist II
4              Shawn Long    American            Assistant Professor
...                   ...         ...                            ...
2995       Joshua Bennett    American       Accounting Assistant III
2996          Dennis Ruiz    European                      Paralegal
2997          Joshua Ryan    American                Statistician IV
2998  Nicholas Cunningham    European  Human Resources Assistant III
2999           Joe Hanson    American            Biostatistician III

     Investment Advisor  ... Credit Card Balance    Bank Loans Bank Deposits  \
0           Victor Dean  ...            484.5440  7.762429e+05  1.485829e+06
1         Jeremy Porter  ...           2256.8777  1.270615e+06  6.414828e+05
2         Ernest Knight  ...           4568.7438  1.052716e+06  1.033402e+06
3             Eric Shaw  ...           4205.0010  1.211951e+05  1.048157e+06
4             Kevin Kim  ...           3779.4880  1.048302e+06  4.877825e+05
...                 ...  ...                 ...           ...           ...
2995     Daniel Carroll  ...            649.8540  2.239351e+05  1.089957e+06
2996     Peter Castillo  ...           1639.0350  5.959020e+05  1.368913e+05
2997      Steve Sanchez  ...           2352.8448  8.804930e+05  2.148609e+05
2998       Juan Ramirez  ...           3578.6088  2.686250e+05  7.426302e+05
2999     Peter Castillo  ...           1494.6876  2.856407e+05  6.561766e+04

      Checking Accounts  Saving Accounts  Foreign Currency Account  \
0          6.036179e+05    607332.455240                12249.9584
1          2.295214e+05    344635.157402                61162.3089
2          6.526747e+05    203054.348179                79071.7794
3          1.048157e+06    234685.019326                57513.6520
4          4.466442e+05    128351.452320                30012.1360
...                 ...              ...                       ...
2995       5.328679e+05    657849.619325                12947.3100
2996       5.658174e+04     93195.608103                23205.6900
2997       1.587261e+05     35539.152952                30291.8112
2998       4.046383e+05     56411.334112                 6413.1444
2999       7.776908e+04     32371.380536                 8992.3608

      Business Lending  Properties Owned  Risk Weighting  \
0         1.134475e+06                 1               2
1         2.000526e+06                 1               3
2         5.481376e+05                 1               3
3         1.148402e+06                 0               4
4         1.674412e+06                 0               3
...                ...               ...             ...
2995      1.238860e+06                 1               3
2996      2.771711e+05                 1               2
2997      5.029472e+05                 2               2
2998      1.538369e+06                 3               1
2999      3.294125e+05                 1               1

                    full detail
0          Raymond Mills   Male
1          Julia Spencer   Male
2       Stephen Murray   Female
3         Virginia Garza   Male
4      Melissa Sanders   Female
...                         ...
2995         Earl Hall   Female
2996  Billy Williamson   Female
2997      Victor Black   Female
2998       Andrew Ford   Female
2999        Amy Nguyen   Female

[3000 rows x 26 columns]

In [4]:
import pandas as pd 
import numpy as np
data=np.array(['a','b','c','d']) 
ser = pd.Series(data)
ser

0    a
1    b
2    c
3    d
dtype: object

In [7]:
directseries=pd.Series(np.array(['a','b','c','d']) ) # we also create series in this way 
directseries

0    a
1    b
2    c
3    d
dtype: object

In [8]:
empty =pd.Series()
empty

Series([], dtype: object)

In [9]:
#creating daataframe

In [11]:
import pandas as pd
data=pd.DataFrame() #EMPTY DATAFRAME 
print(data)

Empty DataFrame
Columns: []
Index: []

In [12]:
list =["pooja","manish","lucky","shilpi"]
df=pd.DataFrame(list)
df

        0
0   pooja
1  manish
2   lucky
3  shilpi

In [14]:
import pandas as pd

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [17]:
print (pd.__version__) #checkin version of pandas

2.1.3

In [18]:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"]) # creating your own labels

print(myvar)

x    1
y    7
z    2
dtype: int64

In [1]:
import pandas as pd
data= pd.read_csv("C:/Users/Pooja/Downloads/company1.csv")
data

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [2]:
data["bonus"]=(data["salary"]/100)*20 #column transformations 
print(data)

    EEID      Name gender   salary   bonus
0  EMP01    ayushi      F      NaN     NaN
1  EMP02     rohit      M  25000.0  5000.0
2  EMP03  pranjali    NaN  27000.0  5400.0
3  EMP01    ayushi      F  20000.0  4000.0
4  EMP05       NaN      M  25000.0  5000.0
5  EMP06     rohit      M      NaN     NaN
6  EMP02     rohit      M  25000.0  5000.0

In [8]:
data={"months":["january" ,"februaru" ,"march" ,"april"]}
a=pd.DataFrame(data)
a
def extract(value):
    return value[0:3]
a["short_months"]=a["months"].map(extract)
print(a)

     months short_mpnths
0   january          jan
1  februaru          feb
2     march          mar
3     april          apr

In [9]:
#group by in pandas

In [28]:
import pandas as pd 
data= pd.read_excel("C:/Users/Pooja/Downloads/ESD.xlsx")
data
data.head(10)

,EEID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
0,E02387,Emily Davis,Sr. Manger,IT,Research & Development,Female,Black,55,2016-04-08,141604,0.15,United States,Seattle,2021-10-16
1,E04105,Theodore Dinh,Technical Architect,IT,Manufacturing,Male,Asian,59,1997-11-29,99975,0.00,China,Chongqing,NaT
2,E02572,Luna Sanders,Director,Finance,Speciality Products,Female,Caucasian,50,2006-10-26,163099,0.20,United States,Chicago,NaT
3,E02832,Penelope Jordan,Computer Systems Manager,IT,Manufacturing,Female,Caucasian,26,2019-09-27,84913,0.07,United States,Chicago,NaT
4,E01639,Austin Vo,Sr. Analyst,Finance,Manufacturing,Male,Asian,55,1995-11-20,95409,0.00,United States,Phoenix,NaT
5,E00644,Joshua Gupta,Account Representative,Sales,Corporate,Male,Asian,57,2017-01-24,50994,0.00,China,Chongqing,NaT
6,E01550,Ruby Barnes,Manager,IT,Corporate,Female,Caucasian,27,2020-07-01,119746,0.10,United States,Phoenix,NaT
7,E04332,Luke Martin,Analyst,Finance,Manufacturing,Male,Black,25,2020-05-16,41336,0.00,United States,Miami,2021-05-20
8,E04533,Easton Bailey,Manager,Accounting,Manufacturing,Male,Caucasian,29,2019-01-25,113527,0.06,United States,Austin,NaT
9,E03838,Madeline Walker,Sr. Analyst,Finance,Speciality Products,Female,Caucasian,34,2018-06-13,77203,0.00,United States,Chicago,NaT

In [16]:
gp=data.groupby("Department").agg({"Gender":"count"})
print(gp)

                 Gender
Department
Accounting           96
Engineering         158
Finance             120
Human Resources     125
IT                  241
Marketing           120
Sales               140

In [19]:
gp=data.groupby("Job Title").agg({"Gender":"count"})
print(gp)

                                Gender
Job Title
Account Representative              21
Analyst                             51
Analyst II                          53
Automation Engineer                  7
Business Partner                    19
Cloud Infrastructure Architect      15
Computer Systems Manager            21
Controls Engineer                   15
Development Engineer                19
Director                           121
Engineering Manager                 20
Enterprise Architect                18
Field Engineer                      21
HRIS Analyst                        16
IT Coordinator                      11
IT Systems Architect                12
Manager                             98
Network Administrator               10
Network Architect                   18
Network Engineer                     7
Operations Engineer                 12
Quality Engineer                    20
Service Desk Analyst                10
Solutions Architect                 15
Sr. Account Representative           9
Sr. Analyst                         70
Sr. Business Partner                17
Sr. Manger                         110
System Administrator                15
Systems Analyst                     15
Technical Architect                 17
Test Engineer                       12
Vice President                     105

In [20]:
gp=data.groupby("Gender").agg({"EEID":"count"})
print(gp)      #here group by performed on gender

        EEID
Gender
Female   518
Male     482

In [24]:
gp=data.groupby(["Department","Gender"]).agg({"EEID":"count"}) # WHEN WE PASS TWO GROUP BY ARGUMENT THEN WE USE SQUARE BRACKET WITHOUT THIS WE GET ERROR SO REMEBER THIS
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [26]:
gp1=data.groupby("Country").agg({"Age":"mean"})
gp1

                     Age
Country
Brazil         43.654676
China          45.389908
United States  44.197512

In [34]:


import pandas as pd 
data= pd.read_excel("C:/Users/Pooja/Downloads/ESD.xlsx")
data
data.head(10)
gp1=data.groupby("Country").agg({"Annual Salary":"max"})
gp1

               Annual Salary
Country
Brazil                258426
China                 257194
United States         258498

In [36]:
gp2=data.groupby(["Country", "Gender"]).agg({"Annual Salary":"max"})
gp2

                      Annual Salary
Country       Gender
Brazil        Female         258426
              Male           249506
China         Female         249686
              Male           257194
United States Female         258498
              Male           258081

In [37]:
gp3=data.groupby(["Country", "Gender"]).agg({"Annual Salary":"max","Age":"min"})
gp3

                      Annual Salary  Age
Country       Gender
Brazil        Female         258426   25
              Male           249506   26
China         Female         249686   25
              Male           257194   25
United States Female         258498   25
              Male           258081   25

In [38]:
 #merge concatenate and join in pandas

In [2]:
import pandas as pd 
data1={"Emp Id":["E01","E02","E03","E04","E05","E06"],
       "Names":["ram","shyam","ramu","shayamu","Ravi","vishal"],
       "Age":[34,56,23,44,32,36]}
data2={"Emp Id":["E01","E02","E03","E04","E05","E06"],
       "salary":[45000,56000,34000,30000,50000,20000]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print (df1)
print(df2)

  Emp Id    Names  Age
0    E01      ram   34
1    E02    shyam   56
2    E03     ramu   23
3    E04  shayamu   44
4    E05     Ravi   32
5    E06   vishal   36
  Emp Id  salary
0    E01   45000
1    E02   56000
2    E03   34000
3    E04   30000
4    E05   50000
5    E06   20000

In [4]:
print(pd.merge(df1,df2,on= "Emp Id"))

  Emp Id    Names  Age  salary
0    E01      ram   34   45000
1    E02    shyam   56   56000
2    E03     ramu   23   34000
3    E04  shayamu   44   30000
4    E05     Ravi   32   50000
5    E06   vishal   36   20000

In [5]:
import pandas as pd 
data1={"Emp Id":["E01","E02","E03","E04","E05","E06"],
       "Names":["ram","shyam","ramu","shayamu","Ravi","vishal"],
       "Age":[34,56,23,44,32,36]}
data2={"Emp Id":["E01","E02","E03","E08","E05","E09"],
       "salary":[45000,56000,34000,30000,50000,20000]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print (df1)
print(df2)

  Emp Id    Names  Age
0    E01      ram   34
1    E02    shyam   56
2    E03     ramu   23
3    E04  shayamu   44
4    E05     Ravi   32
5    E06   vishal   36
  Emp Id  salary
0    E01   45000
1    E02   56000
2    E03   34000
3    E08   30000
4    E05   50000
5    E09   20000

In [6]:
print(pd.merge(left=df1,right=df2,on= "Emp Id",how="left"))

  Emp Id    Names  Age   salary
0    E01      ram   34  45000.0
1    E02    shyam   56  56000.0
2    E03     ramu   23  34000.0
3    E04  shayamu   44      NaN
4    E05     Ravi   32  50000.0
5    E06   vishal   36      NaN

In [7]:
print(pd.merge(left=df1,right=df2,on= "Emp Id",how="right"))

  Emp Id  Names   Age  salary
0    E01    ram  34.0   45000
1    E02  shyam  56.0   56000
2    E03   ramu  23.0   34000
3    E08    NaN   NaN   30000
4    E05   Ravi  32.0   50000
5    E09    NaN   NaN   20000

In [18]:

import pandas as pd
print(pd.join([df1,df2]))

AttributeError: module 'pandas' has no attribute 'join'

In [12]:
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    import pandas as pd 
data1={"Emp Id":["E01","E02","E03","E04","E05","E06"],
       "Names":["ram","shyam","ramu","shayamu","Ravi","vishal"],
       "Age":[34,56,23,44,32,36]} 
data2={"Emp Id":["E07","E08","E09","E10","E11","E12"],
       "Names":["riya","sheerya","ritu","soniya","Ramesh","vasu"],
       "Age":[34,56,23,44,32,36]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print (df1)
print(df2)

  Emp Id    Names  Age
0    E01      ram   34
1    E02    shyam   56
2    E03     ramu   23
3    E04  shayamu   44
4    E05     Ravi   32
5    E06   vishal   36
  Emp Id    Names  Age
0    E07     riya   34
1    E08  sheerya   56
2    E09     ritu   23
3    E10   soniya   44
4    E11   Ramesh   32
5    E12     vasu   36

In [17]:
print(pd.concat([df1,df2])) #concatenat in pandas

  Emp Id    Names  Age
0    E01      ram   34
1    E02    shyam   56
2    E03     ramu   23
3    E04  shayamu   44
4    E05     Ravi   32
5    E06   vishal   36
0    E07     riya   34
1    E08  sheerya   56
2    E09     ritu   23
3    E10   soniya   44
4    E11   Ramesh   32
5    E12     vasu   36

In [19]:
#pandas compare dataframes
#

In [23]:
import pandas as pd
dict={"Fruits":["mango","apple","banana" ,"papaya"],
      "price": [100,150,50,35],
      "quantity":[15,10,10,3]}
df1=pd.DataFrame(dict)
print (df1)

   Fruits  price  quantity
0   mango    100        15
1   apple    150        10
2  banana     50        10
3  papaya     35         3

In [24]:
df2= df1.copy()
df2

   Fruits  price  quantity
0   mango    100        15
1   apple    150        10
2  banana     50        10
3  papaya     35         3

In [26]:
df2.loc[0,"price"]=120
df2.loc[1,"price"]=175
df2.loc[3,"price"]=30
df.loc[0,"quantity"]=12
df.loc[1,"quantity"]=15
df.loc[3,"quantity"]=5
print (df2)

   Fruits  price  quantity
0   mango    120        15
1   apple    175        10
2  banana     50        10
3  papaya     30         3

In [30]:
print(df1.compare(df2))

   price
    self  other
0  100.0  120.0
1  150.0  175.0
3   35.0   30.0

In [29]:
print(df1.compare(df2,align_axis=0))

         price
0 self   100.0
  other  120.0
1 self   150.0
  other  175.0
3 self    35.0
  other   30.0

In [35]:
print(df1.compare(df2,align_axis=0))

         price
0 self   100.0
  other  120.0
1 self   150.0
  other  175.0
3 self    35.0
  other   30.0

In [34]:
print(df1.compare(df2,keep_shape=True))

  Fruits        price        quantity
    self other   self  other     self other
0    NaN   NaN  100.0  120.0      NaN   NaN
1    NaN   NaN  150.0  175.0      NaN   NaN
2    NaN   NaN    NaN    NaN      NaN   NaN
3    NaN   NaN   35.0   30.0      NaN   NaN

In [36]:
print(df1.compare(df2,keep_shape=False))

   price
    self  other
0  100.0  120.0
1  150.0  175.0
3   35.0   30.0

In [37]:
#pivoting and melting dataframes

In [41]:
import pandas as pd
data1={"Emp Id":["E01","E02","E03","E04","E05","E06"],
       "Names":["ram","shyam","ramu","shayamu","Ravi","vishal"],
       "Age":[34,56,23,44,32,36]} 
df=pd.DataFrame(data1)
print(df)

  Emp Id    Names  Age
0    E01      ram   34
1    E02    shyam   56
2    E03     ramu   23
3    E04  shayamu   44
4    E05     Ravi   32
5    E06   vishal   36

In [5]:
#melting concept in pandas

In [6]:
import pandas as pd
data1={"Emp Id":["E01","E02","E03","E04","E05","E06"],
       "Names":["ram","shyam","ramu","shayamu","Ravi","vishal"],
       "Age":[34,56,23,44,32,36]} 
df=pd.DataFrame(data1)
print(df)

  Emp Id    Names  Age
0    E01      ram   34
1    E02    shyam   56
2    E03     ramu   23
3    E04  shayamu   44
4    E05     Ravi   32
5    E06   vishal   36

In [10]:
print (pd.melt(df,id_vars=["Names"],value_vars=["Age"]))

     Names variable  value
0      ram      Age     34
1    shyam      Age     56
2     ramu      Age     23
3  shayamu      Age     44
4     Ravi      Age     32
5   vishal      Age     36

In [12]:
print (pd.melt(df,id_vars=["Age"],value_vars=["Names","Emp Id"]))

    Age variable    value
0    34    Names      ram
1    56    Names    shyam
2    23    Names     ramu
3    44    Names  shayamu
4    32    Names     Ravi
5    36    Names   vishal
6    34   Emp Id      E01
7    56   Emp Id      E02
8    23   Emp Id      E03
9    44   Emp Id      E04
10   32   Emp Id      E05
11   36   Emp Id      E06

In [13]:
# importing pandas as pd 
import pandas as pd 
  
# creating a dataframe 
df = pd.DataFrame({'A': ['John', 'Boby', 'Mina'], 
                   'B': ['Masters', 'Graduate', 'Graduate'], 
                   'C': [27, 23, 21]})
df

      A         B   C
0  John   Masters  27
1  Boby  Graduate  23
2  Mina  Graduate  21

In [16]:
# values can be an object or a list 
df.pivot(index='A', columns='B', values='C')

B     Graduate  Masters
A
Boby      23.0      NaN
John       NaN     27.0
Mina      21.0      NaN

In [15]:
# value is a list 
df.pivot(index='A', columns='B', values=['C', 'A'])

            C                A
B    Graduate Masters Graduate Masters
A
Boby       23     NaN     Boby     NaN
John      NaN      27      NaN    John
Mina       21     NaN     Mina     NaN